package Algorithmization.TasksMassiveOfMassive;
/* Дана матрица. Вывести k-ю строку и p-й столбец матрицы.*/
public class Task3 {
    /*нужны ли комментарии...*/
    private void printer(int[][] a, int k, int p){
        System.out.println(a[k][p]);
    }
}
